Public Attributes | List of all members
API_TabType Struct Reference
Element Manager API
Describes a tabulator of a paragraph. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_TabID  | type
The type of the tab. It should be always APITab_Left. The other options are not implemented yet.
double  | pos
Position of tab in model unit.
Detailed Description
Describes a tabulator of a paragraph.
Member Data Documentation
◆ pos
 API_TabType::pos
Position of tab in model unit.
◆ type
 API_TabType::type
The type of the tab. It should be always APITab_Left. The other options are not implemented yet.